-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 14, 2023 at 09:31 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.0.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `project_web`
--

-- --------------------------------------------------------

--
-- Table structure for table `contact`
--

CREATE TABLE `contact` (
  `id` int(11) NOT NULL,
  `fname` varchar(255) NOT NULL,
  `lname` varchar(255) NOT NULL,
  `email` varchar(255) NOT NULL,
  `message` text NOT NULL,
  `date` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `contact`
--

INSERT INTO `contact` (`id`, `fname`, `lname`, `email`, `message`, `date`) VALUES
(16, 'Ahmed', 'Mahmoud', 'Alrba2003@gmail.com', 'The position property specifies the type of positioning method\n              used for an element (static, relative, absolute, fixed, or\n              sticky).', '2023-05-06'),
(17, 'Ahmed', 'Mahmoud', 'Alrba2003@gmail.com', 'The position property specifies the type of positioning method\r\n              used for an element (static, relative, absolute, fixed, or\r\n              sticky).', '2023-05-06'),
(19, 'Ahmed', 'Mahmoud', 'Alrba2003@gmail.com', 'The position property specifies the type of positioning method\r\n              used for an element (static, relative, absolute, fixed, or\r\n              sticky).', '2023-05-06'),
(20, 'Ahmed', 'Mahmoud', 'Alrba2003@gmail.com', 'The position property specifies the type of positioning method\r\n              used for an element (static, relative, absolute, fixed, or\r\n              sticky).', '2023-05-06');

-- --------------------------------------------------------

--
-- Table structure for table `departments`
--

CREATE TABLE `departments` (
  `id` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `title` text NOT NULL,
  `description` text NOT NULL,
  `type` text NOT NULL,
  `icon` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `departments`
--

INSERT INTO `departments` (`id`, `name`, `title`, `description`, `type`, `icon`) VALUES
(1, 'Cs', 'علوم الحاسب', 'يتميز قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي بأنه يشمل التخصصات الرئيسية في علوم الحاسب، بما في ذلك تطويرالبرمجيات، وإدارة قواعد البيانات، والشبكات الحاسوبية، وأمن المعلومات، وتحليل البيانات، والذكاء الاصطناعي، والحوسبة السحابية، وتطويرتطبيقات الويب، والواقع الافتراضي والواقع المعزز.\r\n\r\nكما يتميز قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي بأنه يوفر للطلاب فرصًا للاستفادة من التكنولوجيا الحديثة والتعلم عن طريق العمل في مشاريع عملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم المعلومات، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\r\n\r\nبالإضافة إلى ذلك، يتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\r\n\r\nوتعمل كلية الحاسبات والذكاء الاصطناعي على فرضية أن الابتكار يأتي من خلال الاختلاف والانفتاح على الآراء المختلفة. لذلك، تشجع الكلية الطلاب على التفاعل مع بعضهم البعض ومشاركة أفكارهم وآرائهم، وتشجع أيضًا التعاون بين الطلاب والأساتذة على مستوى الكلية والجامعة.\r\n\r\nبشكل عام، يعدُّ قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في علوم الحاسب في العالم، ويتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات الحاسوب والتطبيقات المختلفة التي تستخدم في الصناعات المختلفة.', 'قسم عام', 'computer.svg'),
(2, 'IS', 'نظم ومعلومات', 'يعدُّ قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي واحدًا من الأقسام الأكاديمية المهمة في الكلية، حيث يتم تدريس الطلاب كيفية تصميم وتطوير وإدارة نظم المعلومات المختلفة التي تستخدم في الصناعات المختلفة. ويهتم هذا القسم بدراسة البرمجيات والتطبيقات المختلفة التي تستخدم في جمع وتحليل البيانات، وكيفية تصميم النظم الحاسوبية التي تحل مشاكل العالم الحديث.\n\nيتميز قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي بأنه يغطي مجموعة واسعة من التخصصات والمجالات، حيث يشمل دراسة تصميم قواعد البيانات، وتحليل البيانات، وإدارة المشاريع، وتطوير تطبيقات الويب والمواقع الإلكترونية، والتحليل الاستراتيجي، والأمن السيبراني، والحوسبة السحابية، وتطوير البرمجيات.\n\nيتم تدريس الطلاب في قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي على أحدث التقنيات والأدوات المستخدمة في صناعة نظم المعلومات، مما يمكنهم من تطوير مهاراتهم في تحليل المشاكل وتصميم الحلول المناسبة، وتنفيذها وإدارتها بشكل فعال.\n\nيتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\n\nوتعمل كلية الحاسبات والذكاء الاصطناعي على تطوير مهارات الطلاب في قسم نظم المعلومات من خلال توفير فرص للتعلم من خلال العمل العملي والمشاريع العملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم المعلومات، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\n\nبشكل عام، يعدُّ قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في مجال نظم المعلومات في العالم، حيث يتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات نظم المعلومات وتطبيقاتها المختلفة.', 'قسم عام', 'database.svg'),
(3, 'BIo', 'المعلوماتية الحيوية', 'يعدُّ قسم المعلوماتية الحيواتية في كلية الحاسبات والذكاء الاصطناعي واحدًا من الأقسام الأكاديمية الهامة في الكلية، حيث يركز على تطوير التقنيات الحيوية والحوسبية المتعلقة بتحليل البيانات الحيوية وتخزينها وتحليلها وإدارتها.\n\nيشمل قسم المعلوماتية الحيواتية في الكلية دراسة مجموعة واسعة من الموضوعات المتعلقة بالحوسبة الحيوية، بما في ذلك تصميم وتطوير نظم الحوسبة الحيوية، وتحليل البيانات الحيوية، وتصميم وتطوير نظم المعلومات الحيوية، وتصميم وتطوير النماذج الحيوية، والتعلم الآلي في العلوم الحيوية، والجينوميات، وأخرى.\n\nيتم تدريس الطلاب في قسم المعلوماتية الحيواتية في الكلية على أحدث التقنيات والأدوات المستخدمة في مجال المعلوماتية الحيوية، مما يمكنهم من تطوير مهاراتهم في تحليل المشاكل وتصميم الحلول المناسبة، وتنفيذها وإدارتها بشكل فعال.\n\nيتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم المعلوماتية الحيواتية في الكلية. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\n\nوتعمل كلية الحاسبات والذكاء الاصطناعي على تطوير مهارات الطلاب في قسم المعلوماتية الحيواتية من خلال توفير فرص للتعلم من خلال العمل العملي والمشاريع العملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم المعلومات الحيوية، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\n\nبشكل عام، يعدُّ قسم المعلوماتية الحيواتية في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في مجال المعلوماتية الحيوية في العالم، حيث يتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات المعلوماتية الحيوية وتطبيقاتها المختلفة.', 'قسم خاص', 'dna.svg'),
(4, 'AI', 'الذكاء الاصطناعي', 'يتميز قسم الذكاء الاصطناعي في كلية الحاسبات والذكاء الاصطناعي بأنه واحدًا من أهم الأقسام الأكاديمية في الكلية، حيث يركز على تعليم الطلاب كيفية تصميم وتطوير التطبيقات والنظم التي تعتمد على تقنيات الذكاء الاصطناعي.\n\nيشمل قسم الذكاء الاصطناعي في الكلية دراسة مجموعة واسعة من الموضوعات المتعلقة بالذكاء الاصطناعي، بما في ذلك تصميم وتطوير نماذج التعلم الآلي، وتصميم وتطوير نظم الروبوت، والتعلم العميق، ومعالجة اللغة الطبيعية، والتعلم الآلي في الرؤية الحاسوبية، وتحليل البيانات، والتعلم التعاوني، وأخرى.\n\nيتم تدريس الطلاب في قسم الذكاء الاصطناعي في الكلية على أحدث التقنيات والأدوات المستخدمة في مجال الذكاء الاصطناعي، مما يمكنهم من تطوير مهاراتهم في تحليل المشاكل وتصميم الحلول المناسبة، وتنفيذها وإدارتها بشكل فعال.\n\nيتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم الذكاء الاصطناعي في الكلية. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\n\nوتعمل كلية الحاسبات والذكاء الاصطناعي على تطوير مهارات الطلاب في قسم الذكاء الاصطناعي من خلال توفير فرص للتعلم من خلال العمل العملي والمشاريع العملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم الذكاء الاصطناعي، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\n\nبشكل عام، يعدُّ قسم الذكاء الاصطناعي في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في مجال الذكاء الاصطناعي في العالم، حيث يتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات الذكاء الاصطناعي وتطبيقاتها المختلفة.', 'قسم خاص', 'robot.svg');

-- --------------------------------------------------------

--
-- Table structure for table `event`
--

CREATE TABLE `event` (
  `id` int(11) NOT NULL,
  `img` varchar(255) NOT NULL,
  `title` text NOT NULL,
  `description` text NOT NULL,
  `date` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `event`
--

INSERT INTO `event` (`id`, `img`, `title`, `description`, `date`) VALUES
(15, '1684088140.png', 'اصنع وقتاً أكثر من المتاح', 'الأهم من النجاح هو إيجاد الوقت المناسب له! يفتقر الكثير من الناس إلى مفهوم الوقت المناسب والذي يعود لعدم إدراكهم لوجود ما يُسمَّى بفن إدارة الوقت... هل تقضي عدد ساعات في سدّ حاجات الآخرين بينما تعجز عن سد احتياجاتك الخاصة؟ هل تشعر أنك مجرد ترس في آلة الحياة والسرعة والعمل؟', '2023-05-30');

-- --------------------------------------------------------

--
-- Table structure for table `faqs`
--

CREATE TABLE `faqs` (
  `id` int(11) NOT NULL,
  `question` text NOT NULL,
  `answer` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `faqs`
--

INSERT INTO `faqs` (`id`, `question`, `answer`) VALUES
(34, 'كيف يمكنني تحسين مهارات الدراسة والتركيز؟', 'يمكنك تحسين مهارات الدراسة والتركيز عن طريق وضع خطط دراسية محددة، وتحديد مواعيد للدراسة والاستراحة، وتجنب الانشغال بالهاتف ووسائل التواصل الاجتماعي أثناء الدراسة. كما يمكنك تطوير مهاراتك في القراءة والمذاكرة عن طريق الممارسة المنتظمة.'),
(35, 'كيف يمكنني اختيار التخصص الجامعي المناسب لي؟', 'يمكنك اختيار التخصص الجامعي المناسب لك عن طريق البحث والتحقيق في المجالات المختلفة، والتحدث مع المستشارين الأكاديميين والمساعدين التعليميين، والتحدث مع الطلاب في التخصصات المختلفة. كما يمكنك النظر في مجالات العمل المختلفة ومتطلباتها، ومقارنتها بمهاراتك واهتماماتك.'),
(36, 'كيف يمكنني الحصول على فرص عمل بعد التخرج وتأهيل نفسي للعمل في سوق العمل؟', 'يمكنك الحصول على فرص عمل بعد التخرج عن طريق البحث عن فرص عمل والتقدم لها، وتطوير مهاراتك وخبراتك من خلال العمل التطوعي والدورات التدريبية، وتحسين مهارات الاتصال والتواصل والتعامل مع الآخرين. كما يمكنك الاستعانة بمستشاري الوظائف والمساعدين الوظيفيين للحصول على المساعدة اللازمة.'),
(41, 'كيف يمكنني تحسين مهارات الكتابة الأكاديمية والبحث؟', 'يمكنك تحسين مهارات الكتابة الأكاديمية والبحث عن طريق الممارسة المنتظمة والتدريب، وإجراء البحوث والدراسات الأكاديمية والمشاركة في المناقشات الأكاديمية، والتحدث مع الأساتذة والمستشارين الأكاديميين للحصول على المساعدة والإرشاد.');

-- --------------------------------------------------------

--
-- Table structure for table `login`
--

CREATE TABLE `login` (
  `id` int(11) NOT NULL,
  `email` varchar(255) NOT NULL,
  `password` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `login`
--

INSERT INTO `login` (`id`, `email`, `password`) VALUES
(1, 'admin', 'd033e22ae348aeb5660fc2140aec35850c4da997'),
(2, 'manthoo', 'b447fc351ceae8dcc7bf2a7581675abf67656359');

-- --------------------------------------------------------

--
-- Table structure for table `news`
--

CREATE TABLE `news` (
  `id` int(11) NOT NULL,
  `img` varchar(255) NOT NULL,
  `title` text NOT NULL,
  `description` text NOT NULL,
  `date` date NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `news`
--

INSERT INTO `news` (`id`, `img`, `title`, `description`, `date`) VALUES
(31, '1683868427.jpeg', 'افتتاح كلية الحاسبات', '  افتتاح كلية الحاسبات والذكاء الاصطناعــي بجامعة مدينة الســادات لأول مرة منذ أكثر من عام افتتاح كلية الحاسبات والذكاء الاصطناعــي بجامعة مدينة الســادات لأول مرة منذ أكثر من عام', '2023-05-06'),
(33, '1684087439.jpeg', 'تدشين ورشة العمل الخاصه ببدء الموسم التدريبى للمسابقه الدوليه للبرمجه', ' نظمت كلية الحاسبات والذكاء الإصطناعي بجامعة مدينة السادات ندوه بعنوان \"تدشين ورشة العمل الخاصه ببدء الموسم التدريبي للمسابقه الدوليه للبرمجة\" .\r\n تحت رعاية الدكتوره شادن معاويه رئيس الجامعه ، والدكتور شريف محمد علي، نائب رئيس الجامعة لشئون التعليم والطلاب ، والدكتور إبراهيم محمد سليم عميد الكلية .\r\nأستهلت الندوه بتلاوة آيات من القرآن الكريم ، ثم كلمة الدكتور إبراهيم سليم حيث رحب برئيس الجامعة ، و نائب رئيس الجامعة لشئون التعليم والطلاب ، وأكد علي أهمية هذه المسابقة، وأهمية المشاركه بها، ورغبته في مواكبة الكلية للتطور الرقمي والتكنولوجي السريع في هذا الوقت، وأكد علي حث الطلاب علي الفوز بهذه المسابقه حيث تتمكن الكليه من تمثيل مشرف للجامعه، وتمثيل مصر  في البرازيل.\r\nوفى كلمتها رحبت رئيس الجامعة بتدشين ورشة العمل الخاصه بمسابقة البرمجه الجماعيه الدوليه (ICPC) \"International Collegiate Programming Contest\"مسابقة البرمجة العالمية  التي تجريها جامعات العالم لتساعد على تعزيز التعاون والإبداع والإبتكار، والقدره على الأداء تحت الضغط من خلال التدريب والمنافسة ، وأن الجامعه لا تألوا جهداً وحريصه على تنظيم ودعم الفعاليات التي تحفز مهارات التعلم الذاتي والمشاركة فيها، فالتعليم القائم على المنافسة يثري النظام التعليمي. ولمسنا من خلال التجارب حدوث تغيرات دراماتيكية في أداء الطلبة بعد مشاركتهم .\r\nوأضافت \"معاويه أن تكون الفرق المشاركة مفعمة بروح العمل الجماعي والحماس ، وأن المسابقة تمثل فرصة للشركات الحكومية والخاصة التي تسعى وراء توظيف المبرمجين والمطورين الأكفاء ، ناتج لإقبال الشركات نحو الخدمات الرقمية، والبحث عن طرق مبتكرة وجديدة للتواصل مع عملائها وتوسيع نطاق أعمالها ، مؤكدة أن الجامعة تسعى جاهدة على تشجيع طلابها على المشاركة في هذه الفعاليات، بهدف بناء مهاراتهم وصقل شخصياتهم، لكي يتسلحوا بالمعرفة وأفضل الكفاءات والإمكانات بعد تخرجهم، مشيدة  بقدرة طلاب كلية الحاسبات والذكاء الإصطناعي وفريق متميز من أعضاء هيئة التدريس، متمنية التوفيق والمنافسة في المسابقات المحلية والعالمية وتحقيق الفوز بمراكز متقدمة، مؤكده على  دعمها الكامل للفرق الطلابية المشاركة .\r\nكما أوضح نائب رئيس الجامعه لشئون التعليم والطلاب عنسعادته البالغه بمثل هذه المسابقات التى تظهر الطالب الجامعي المبدع  متمنياً التوفيق لطلبة الجامعه وكلية الحاسبات والذكاء الإصطناعى ، وهنأ الجميع بحلول شهر رمضان المبارك ،  كما أوضح ضرورة مواكبة التطور التكنولوجي والرقمي بالعالم .\r\n وفي ختام الندوه تم تسليم الدروع من قبل عميد الكلية إلي رئيس الجامعه ، ونائب رئيس الجامعه لشئون التعليم والطلاب ، كما تم تكريم الساده أعضاء هيئة التدريس ، والطلبه المتفوقين', '2023-05-06'),
(34, '1684087213.jpeg', '  مناقشه السيمنار لرساله الماجيستير لباشمهندس محمد توني حماد', 'تحت رعايه السيد الاستاذ الدكتور / ابراهيم محمد سليم عميد كليه الحاسبات والذكاء الاصطناعى جامعه مدينه السادات تم مناقشه السيمنار لرساله الماجيستير بعنوان ( تقنيه تشخيص اورام المخ لصور الرنين المغناطيسى اعتمادا على الذكاء الاصطناعى ) للمهندس / محمد تونى حماد', '2023-05-06'),
(41, '1684086998.jpeg', 'كلية الحاسبات والذكاء الاصطناعي جامعة مدينة السادات تشارك في فعاليات المرحلة التمهيدية للمسابقة الدولية \" ECPC\"', 'استضافت اليوم الأحد الأكاديمية العربية للعلوم والتكنولوجيا والنقل البحري فعاليات المرحلة التمهيدية المسابقة الدولية \" ECPC\" بمنطقة أبو قير بالإسكندرية.\r\nتحت رعاية الدكتور خالد جعفر القائم بأعمال رئيس الجامعة ، والدكتور إبراهيم سليم عميد كلية الحاسبات والذكاء الاصطناعي.\r\nوأشار جعفر من أنه لابد من تنمية قدرات الشباب وإبداعاتهم وتشجيعهم لمثل تلك المسابقات والتى بدورها تقوم على خدمة المجتمع ككل من منافسات شريفة .\r\nوأضاف أن خطة الجامعة الإستيرايجية والتى تتفق مع رؤية مصر وخطة التنمية المستدامة ( دولة المقر)٢٠٣٠ ، والتى تهدف إلى بناء الدولة المصرية الجديدة ، والتى بدورها ستكون الركيزة والأساس نحو التكنولوجيا والإبتكار والمعرفة ، وسيكون للمهندسين والمبتكرين دور كبير وأساس فى التطوير والإبداع، وتحفيز المسؤولية الإجتماعية لدى الشباب وتشجيع عقولهم على الإبداع.\r\nومن جانبه أكد الدكتور إبراهيم سليم عميد الكلية أن هذه المسابقة تقوم على إقتراح وتنفيذ وتطوير نماذج مشروعات تكنولوجية، أو انظمة برمجة تفيد في تطوير المستقبل ، وأن لهذه المسابقة هدف يفيد في تطوير المستقبل ، وأن لهذه المسابقة هدف يفيد في تحقيق أهداف الأمم المتحدة للتنمية المستدامة ، ويتقدم الفائزين في المرحلة التمهيدية للدخول للمسابقة النهائية على مستوى الجامعات المصرية .\r\nوفى السياق ذاته شارك مركز دعم وتسويق الإختراعات والإبتكارات بجامعة مدينة السادات بحضور مديرة المركز الدكتورة/ هاله عبد العال من خلال أبناء المركز وقد سبق لهم الفوز بالمركز الأول في المسابقة التى أطلقها المركز تحت عنوان \" أفكار مبتكرة لتشجيع فصل المخلفات البيئية من المنبع\" ومن المشاركين في مسابقة البرمجة \" ECPC\" وذلك لتشجيع الطلاب ودعمهم معنوياً من خلال تلك المسابقات ، وتشجيع طلاب الجامعة وكلية الحاسبات وتحفيزهم فى تحقيق مراكز متقدمة.\r\nجدير بالذكر أن متسابقين اليوم السابع للتصفيات كلية العلوم جامعة عين شمس ، وجامعة الأزهر ، وجامعة النيل ، وكلية الحاسبات والذكاء الاصطناعي جامعة مدينة السادات ، وجامعة المنوفية .\r\nوتشارك جامعة مدينة السادات بعدد ٤٨ طالب وطالبة بحضور الدكتور أحمد جمال مدرس بكلية الحاسبات والذكاء الاصطناعي ، والدكتورة أسماء سعد المدرس المساعد بكلية الحاسبات والذكاء الاصطناعي\r\nوإشراف الاستاذ عمرو عامر ، الاستاذ محمود الشاهد رعاية الشباب بكلية الحاسبات', '2023-05-11'),
(45, '1684076618.jpeg', 'تكليف الدكتوره \"شادن معاويه\" قائم بعمل رئيس جامعة مدينة السادات', '  كلف اليوم السبت، الدكتور أيمن عاشور وزير التعليم العالي والبحث العلمي الدكتوره شادن معاويه حفنى محمود، الأستاذه بمعهد بحوث الهندسه الوراثيه والتكنولوجية الحيويه بجامعة مدينة السادات ، بتسيير أعمال جامعة مدينة السادات لحين الإنتهاء من إجراءات تعيين رئيسا جديدا للجامعه.\r\n\r\nجدير بالذكر أن الدكتوره \"شادن معاويه\" حصلت على بكالوريوس علوم الكيمياء الحيويه بتقدير ممتاز بكلية العلوم جامعة الإسكندرية ، وماجستير فى الكيمياء الحيويه بكلية العلوم جامعة الإسكندرية ، ودكتوراه فى فلسفة العلوم فى الكيمياء الحيويه بكلية العلوم جامعة الإسكندرية.\r\nعملت مدرس مساعد فى الكيمياء الحيويه والهندسه الوراثيه بمعهد بحوث التكنولوجيا الحيويه جامعة المنوفية - مدينة السادات ، ثم مدرس الكيمياء الحيويه بمعهد بحوث الهندسه الوراثيه والتكنولوجية الحيويه بجامعة المنوفية بمدينة السادات ، ثم أستاذ الكيمياء الحيويه قسم البيولوجيا الجزيئية بمعهد بحوث الهندسه الوراثيه والتكنولوجية الحيويه بجامعة المنوفية بمدينة السادات ، ومديرة الوحدات ذات الطابع الخاص في معهد بحوث الهندسه الوراثيه والتكنولوجية الحيويه ، ووكيلة خدمة المجتمع وتنمية البيئة بمعهد بحوث الهندسه الوراثيه والتكنولوجية الحيويه ، وعميدة كلية الصيدلة جامعة مدينة السادات،  ونائب رئيس جامعة مدينة السادات للدراسات العليا والبحوث العلمية ، حيث عملت على رفع تصنيف الجامعه، وأولت إهتماما كبيراً بالبحث العلمي وتشجيع الدراسات البحثيه، وأخيراً قائم بعمل رئيس جامعة مدينة السادات لحين صدور قرار برئيس الجامعة', '2023-05-12');

-- --------------------------------------------------------

--
-- Table structure for table `services`
--

CREATE TABLE `services` (
  `id` int(11) NOT NULL,
  `title` text NOT NULL,
  `description` text NOT NULL,
  `forwho` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `services`
--

INSERT INTO `services` (`id`, `title`, `description`, `forwho`) VALUES
(3, 'كيفية التقديم', '.١.شهادة الثانوية العامة أو ما يعادلها (ورقة الترشيح)\r\n.٢. شهادة الميلاد\r\n.٣. صورة بطاقة الرقم القومي\r\n.٤. شهادة الخدمة العسكرية (للذكور).( استمارة 6و2 جند)\r\n.6 ٥.صورة شخصية حديثة\r\n.٦.نموذج تقديم الطلب الإلكتروني\r\n٧. سداد الرسوم الدراسية ورسوم التقديم', 'زائر'),
(4, 'عن الجامعه', 'جامعة السادات  تعتبر إحدى الجامعات الحكومية الرائدة في مصر.\n\nتأسست جامعة السادات في عام 2011 بموجب القرار الجمهوري رقم 361 لعام 2011، وتقع في مدينة السادات بمحافظة المنوفية. تضم الجامعة العديد من الكليات والمعاهد الأكاديمية المتخصصة في مجالات متنوعة، مثل الهندسة والعلوم والتجارة والحقوق والتربية والصيدلة والطب والعلوم الإنسانية والاجتماعية.\n\nتسعى جامعة السادات إلى تحقيق رؤيتها في تطوير البحث العلمي والتكنولوجيا، وتوفير التعليم العالي الجودة والمتميز، وإعداد الخريجين القادرين على المنافسة والتميز في سوق العمل، وتحقيق التنمية المستدامة والمساهمة في رفاهية المجتمع وتحسين جودة الحياة في مصر والعالم.\n\nتتميز جامعة السادات بتوفير بيئة تعليمية حديثة ومجهزة بأحدث التقنيات، كما تحرص الجامعة على توفير فرص التعلم العملي والتدريب الميداني للطلاب، وذلك من خلال شراكاتها مع الشركات والمؤسسات الكبرى في مختلف القطاعات الحيوية.\n\nتضم جامعة السادات مراكز بحثية متخصصة تعمل على تحقيق التقدم العلمي والتكنولوجي في مجالات مختلفة، وتحرص الجامعة على تطوير الدراسات العليا وتعزيز القدرة البحثية للجامعة. كما تسعى الجامعة إلى إرساء قيمها وأخلاقياتها، ودعم وتشجيع كليات ومعاهد الجامعة لتطبيق الاعتماد، وتعزيز العلاقات بين الجامعة والمجتمع المحلي والدولي.\n\nوبفضل جهودها الحثيثة في تحقيق رؤيتها وتحقيق أهدافها، تعد جامعة السادات واحدة من الجامعات الحكومية الرائدة في مصر والمنطقة، وتتمتع بسمعة مرموقة وشهادة اعتراف عالمية.\n\nومن الجدير بالذكر أن جامعة السادات تتميز بمجموعة من المشاريع البحثية والتطبيقية التي تهدف إلى تطوير المجتمع وتحسين جودة الحياة، مثل مشروع تطوير زراعة الأرز ومشروع إنتاج الكهرباء من الطاقة الشمسية ومشروع تشجيع ريادة الأعمال وغيرها الكثير. كما تحرص الجامعة على توفير فرص التعليم المستمر للمجتمع المحلي والدولي من خلال برامج التعليم المفتوح والتعليم عن بعد والتدريب المهني', 'زائر'),
(5, 'عن الكلية', 'تأسست كلية الحاسيات والذكاء الاصطناعي في جامعة السادات في عام 2019، وهي إحدى الكليات الحديثة في مصر التي تهتم بمجالات الحاسوب والذكاء الاصطناعي وعلوم البيانات والأمن السيبراني. تهدف الكلية إلى تدريب الطلاب على استخدام التقنيات الحديثة في حل المشكلات وتطوير الحلول المبتكرة للمشاكل الحقيقية في العالم.\n\nتعتبر كلية الحاسيات والذكاء الاصطناعي في جامعة السادات مؤسسة تعليمية رائدة في مصر، حيث تقوم بتدريس الطلاب المهارات اللازمة للعمل في مجالات الحاسوب والذكاء الاصطناعي وعلوم البيانات والأمن السيبراني. وتستخدم المناهج التعليمية الحديثة والتكنولوجيا الحديثة لتحقيق هذه الأهداف.\n\nتتميز كلية الحاسيات والذكاء الاصطناعي في جامعة السادات بتوفير بيئة تعليمية حديثة ومتطورة، وذلك بفضل قاعات الدراسة المجهزة بأحدث الأجهزة والتقنيات، والمختبرات المتطورة التي تساعد الطلاب في تطبيق المفاهيم التي يتم تدريسها. كما توفر الكلية مجموعة من المعدات الحديثة مثل الروبوتات والطائرات بدون طيار وأجهزة الواقع الافتراضي والواقع المعزز وغيرها من التقنيات المتطورة التي تساعد الطلاب على التعرف على أحدث الابتكارات في مجالات الحاسوب والذكاء الاصطناعي.\n\nتضم الكلية هيئة تدريسية متميزة، حيث يتمتع أعضاء الهيئة بخبرة واسعة في مجالاتهم، كما يتمتعون بمهارات تدريسية عالية تساعد الطلاب في فهم المفاهيم بشكل أفضل وتطبيقها بكفاءة. وتشمل الهيئة التدريسية على أساتذة وخبراء في مجالات الحاسوب والذكاء الاصطناعي وعلوم البيانات والأمن السيبراني.\n\nتتميز كلية الحاسيات والذكاء الاصطناعي في جامعة السادات أيضاً بالتعاون مع الصناعة والمؤسسات الحكومية والخاصة، وذلك من خلالتقديم برامج تدريبية وورش عمل ومشاريع تخرج تتيح للطلاب فرصة التعرف على متطلبات سوق العمل وتطبيق المفاهيم التي يتم تدريسها في بيئة عمل حقيقية. وتتعاون الكلية مع عدد من الشركات والمؤسسات الكبرى في مجالات الحاسوب والذكاء الاصطناعي وعلوم البيانات والأمن السيبراني، مما يتيح للطلاب الفرصة للتعرف على أحدث التقنيات والابتكارات في هذه المجالات.\n\nتشتمل برامج الكلية على برنامج البكالوريوس في الحاسوب والذكاء الاصطناعي، وبرنامج الماجستير في الحوسبة السحابية وعلوم البيانات، وبرنامج الدكتوراه في الحوسبة السحابية وعلوم البيانات والأمن السيبراني. وتعتمد البرامج التعليمية في الكلية على النهج العملي، حيث يتم تدريس الطلاب المفاهيم النظرية وتطبيقها في مشاريع العمل العملية.\n\nتتميز الكلية أيضاً بمركز الابتكار والريادة، الذي يهدف إلى تشجيع الطلاب على تطوير حلول مبتكرة للمشاكل الحقيقية في العالم. وتقوم الكلية بتنظيم العديد من الفعاليات والمسابقات التي تشجع الطلاب على تطوير مهاراتهم وتعزيز قدراتهم الابتكارية.\n\nباختصار، تعتبر كلية الحاسيات والذكاء الاصطناعي في جامعة السادات إحدى الكليات الحديثة والمتميزة في مصر، وتوفر بيئة تعليمية حديثة ومتطورة، وتضم هيئة تدريسية متميزة، وتتميز بالتعاون المستمر مع الصناعة والمؤسسات الحكومية والخاصة لتمكين الطلاب من تطبيق المفاهيم التي يتم تدريسها في بيئة عمل حقيقية. وتقدم الكلية برامج تعليمية حديثة وعملية في مجالات الحاسوب والذكاء الاصطناعي وعلوم البيانات والأمن السيبراني، وتشجع الطلاب على التعلم العملي والابتكار والريادة من خلال الفعاليات والمسابقات التي تنظمها.\n', 'زائر'),
(7, 'منصور', 'وصف', 'خريج'),
(8, 'تعرف علي الدراسات العليا', 'تقدم الدراسات العليا في كلية الحاسبات والذكاء الاصطناعي بجامعة مدينة السادات فرصة فريدة للطلاب للتخصص في أحدث مجالات علوم الكمبيوتر والذكاء الاصطناعي. مع التركيز القوي على البحث ، توفر الكلية منصة ممتازة للطلاب لتطوير مهاراتهم ومعرفتهم في هذه المجالات سريعة التطور.\n\nتم تصميم برامج الدراسات العليا التي تقدمها الكلية لتزويد الطلاب بالمهارات اللازمة للنجاح في مجموعة متنوعة من الأدوار ، بما في ذلك البحث والتطوير والأوساط الأكاديمية والصناعة. تقدم الكلية مجموعة من برامج الدراسات العليا ، بما في ذلك درجتي الماجستير والدكتوراه ، في مجالات مثل علوم الكمبيوتر والذكاء الاصطناعي والتعلم الآلي وعلوم البيانات.\n\nبرنامج الماجستير بالكلية في علوم الكمبيوتر هو برنامج شامل يغطي مجموعة من الموضوعات ، بما في ذلك هندسة البرمجيات وشبكات الكمبيوتر وأنظمة قواعد البيانات والذكاء الاصطناعي. يتعرض الطلاب في هذا البرنامج لأحدث التطورات في علوم الكمبيوتر ويتم تزويدهم بخبرة عملية في استخدام أدوات وتقنيات الحوسبة الحديثة. عند الانتهاء من البرنامج ، يكون الخريجون مجهزين تجهيزًا جيدًا لمتابعة وظائف في مجموعة متنوعة من الصناعات ، بما في ذلك تطوير البرمجيات واستشارات تكنولوجيا المعلومات وتحليل البيانات.\n\nتم تصميم برنامج الدكتوراه بالكلية في الذكاء الاصطناعي للطلاب الذين يرغبون في ممارسة مهنة في البحث والتطوير في مجال الذكاء الاصطناعي. يغطي البرنامج موضوعات مثل التعلم الآلي ومعالجة اللغة الطبيعية ورؤية الكمبيوتر والروبوتات. يُتوقع من الطلاب في هذا البرنامج إجراء بحث أصلي في هذه المجالات ، ويتم تزويدهم بالموارد والدعم اللازمين للقيام بذلك. عند الانتهاء من البرنامج ، يكون الخريجون مستعدين جيدًا لمتابعة وظائف في الأوساط الأكاديمية ومؤسسات البحث والصناعة.\n\nتعد هيئة التدريس إحدى نقاط القوة الرئيسية في برامج الدراسات العليا بالكلية. تتكون هيئة التدريس من باحثين وممارسين ذوي خبرة يشاركون بنشاط في أحدث الأبحاث في علوم الكمبيوتر والذكاء الاصطناعي. وهذا يضمن أن الطلاب يتعرضون لأحدث التطورات في هذه المجالات ويتم تزويدهم بالإرشادات والدعم اللازمين لإجراء أبحاثهم الخاصة.\n\nقوة أخرى للكلية هي مرافقها البحثية. تمتلك الكلية مرافق بحثية حديثة ، بما في ذلك المعامل المجهزة بأحدث الأجهزة والبرامج ، بالإضافة إلى الوصول إلى موارد الحوسبة عالية الأداء. يوفر هذا للطلاب الأدوات اللازمة لإجراء البحوث المتقدمة في علوم الكمبيوتر والذكاء الاصطناعي.\n\nفي الختام ، توفر الدراسات العليا في كلية الحاسبات والذكاء الاصطناعي بجامعة مدينة السادات فرصة ممتازة للطلاب للتخصص في أحدث مجالات علوم الكمبيوتر والذكاء الاصطناعي. من خلال التركيز القوي على البحث وأعضاء هيئة التدريس ذوي الخبرة ومرافق البحث الحديثة ، تزود الكلية الطلاب بالمهارات والمعرفة اللازمة للنجاح في مجموعة متنوعة من الأدوار في الأوساط الأكاديمية ومؤسسات البحث والصناعة.\n', 'هيئة التدريس'),
(14, 'Google Scholar ', 'Google Scholar هي محرك بحث يتيح للمستخدمين العثور على الأبحاث والمقالات الأكاديمية المنشورة في المجلات والمؤتمرات والكتب الأكاديمية المختلفة. يمكن استخدام Google Scholar للحصول على أبحاث ومقالات في مجالات مختلفة بما في ذلك العلوم، الهندسة، الطب، الإدارة، والاقتصاد.\n\nتساعد هذه الأبحاث والمقالات المستخدمين على البحث عن المعلومات الأكاديمية الحديثة والمتخصصة في مجالاتهم.\n\nميزات Google Scholar\n\nتتميز Google Scholar بمجموعة من الميزات الهامة التي تساعد المستخدمين على العثور على الأبحاث والمقالات المناسبة لهم وتحسين تجربة البحث لديهم. ومن بين هذه الميزات:\n\nفلاتر البحث: يسمح للمستخدمين بتحديد بعض الفلاتر لتحسين نتائج البحث، مثل النوع، التاريخ، المؤلف، والمجلة.\n\nمقاييس الاستشهاد: يعرض Google Scholar عدد مرات الاستشهاد بالمقالات والأبحاث من قبل مقالات وأبحاث أخرى، مما يسمح للمستخدمين بتقييم تأثير المقالات والأبحاث.\n\nالوصول الكامل إلى النص الكامل: يمكن للمستخدمين الوصول إلى النص الكامل للأبحاث والمقالات الأكاديمية، وذلك حتى إذا كانت هذه المقالات والأبحاث خلف جدران الدفع.\n\nالتنبيهات: يمكن للمستخدمين إعداد التنبيهات للحصول على إخطارات حول المقالات والأبحاث الجديدة التي تم نشرها في Google Scholar وتتطابق مع مجالات اهتمامهم.', 'هيئة التدريس'),
(15, 'Google Scholar كيفية استخدام', 'يمكن للمستخدمين استخدام Google Scholar بسهولة وفعالية للبحث عن الأبحاث والمقالات الأكاديمية. ومن بين الطرق التي يمكن استخدامها:\n\nالبحث الأساسي: يمكن للمستخدمين إدخال المصطلحات الخاصة بهم في شريط البحث على Google Scholar.\n\nالتحديد: يمكن للمستخدمين استخدام الفلاتر المختلفة لتحديد تاريخ النشر، النوع، المؤلف، والمجلة.\n\nمقاييس الاستشهاد: يمكن للمستخدمين استخدام مقاييس الاستشهاد لتحديد تأثير المقالات والأبحاث واختيار المقالات ذات التأثير الكبير.\n\nالوصول الكامل إلى النص الكامل: يمكن للمستخدمين الوصول إلى النص الكامل للأبحاث والمقالات عن طريق الرابط \"العثور عليه @ [مؤسستك]\".\n\nالتنبيهات: يمكن للمستخدمين إعداد التنبيهات لتلقي إخطارات حول المقالات والأبحاث الجديدة المنشورة في Google Scholar.\n\nفي النهاية، يمكن للمستخدمين الاستفادة من Google Scholar في العثور على الأبحاث والمقالات الأكاديمية وتحسين تجربة البحث لديهم. يمكن استخدام الفلاتر المختلفة ومقاييس الاستشهاد والوصول الكامل إلى النص الكامل والتنبيهات لجعل عملية البحث أكثر فعالية وسهولة.\n', 'هيئة التدريس'),
(16, 'بوابة بنك المعرفة', 'تعد بوابة المعرفة من الأدوات الأكثر أهمية لأعضاء هيئة التدريس، حيث تساعد في تحسين عملية التدريس والبحث العلمي. وتوفر بوابة المعرفة مجموعة من الموارد الأكاديمية والتعليمية، مثل المقالات العلمية والكتب والأبحاث والدوريات العلمية، إلى جانب دورات التدريب وورش العمل والمؤتمرات.\r\n\r\nفي هذه المقالة، سأتحدث عن بعض الميزات المهمة لبوابة المعرفة وكيفية استخدامها بفعالية.\r\n\r\nميزات بوابة المعرفة\r\n\r\nمجموعة واسعة من الموارد الأكاديمية: تتيح بوابة المعرفة لأعضاء هيئة التدريس الوصول إلى مجموعة واسعة من الموارد الأكاديمية والتعليمية، مثل المقالات العلمية والكتب والأبحاث والدوريات العلمية.\r\n\r\nالحصول على المعلومات بسهولة: تتيح بوابة المعرفة لأعضاء هيئة التدريس الحصول على المعلومات بسهولة وفي وقت قصير، مما يساعدهم في تحضير الدروس والبحوث العلمية بشكل أكثر فعالية.\r\n\r\nموارد متوفرة على مدار الساعة: تتوفر الموارد الأكاديمية والتعليمية على بوابة المعرفة على مدار الساعة، مما يسمح لأعضاء هيئة التدريس بالوصول إليها في أي وقت يحتاجونها.\r\n\r\nالبحث السريع: يمكن لأعضاء هيئة التدريس البحث عن المعلومات على بوابة المعرفة بسرعة وسهولة، وذلك عبر استخدام محرك البحث المتاح على البوابة.\r\n\r\nكيفية استخدام بوابة المعرفة\r\n\r\nالتسجيل والدخول: يجب على أعضاء هيئة التدريس التسجيل على بوابة المعرفة وتسجيل الدخول باستخدام اسم المستخدم وكلمة المرور.\r\n\r\nالبحث عن الموارد: يمكن البحث عن الموارد الأكاديمية والتعليمية على بوابة المعرفة باستخدام محرك البحث. كما يمكن البحث عن الموارد بحسب الموضوع أو النوع أو المؤلف.\r\n\r\nتنزيل الموارد: يمكن لأعضاء هيئة التدريس تنزيل الموارد الأكاديمية والتعليمية اللازمة لهم من بوابة المعرفة. ويمكن تنزيل هذه الموارد بصيغ مختلفة، مثل PDF وDOC وPPT وغيرها.\r\n\r\nالمشاركة والتفاعل: يمكن لأعضاء هيئة التدريس المشاركة في المناقشات والتفاعل مع الآخرين على بوابة المعرفة، وذلك من خلال المشاركة في المنتديات والمجموعات الحوارية المتوفرة على البوابة.\r\n\r\nحجز دورات التدريب: يمكن لأعضاء هيئة التدريس حجز دورات التدريب وورش العمل والمؤتمرات المتوفرة على بوابة المعرفة، وذلك من خلال القائمة المتاحة على البوابة.\r\n\r\nفي النهاية، تعد بوابة المعرفة أداة هامة لأعضاء هيئة التدريس، حيث تساعدهم في تحسين عملية التدريس والبحث العلمي. ويمكن استخدام بوابة المعرفة بشكل فعال عن طريق التسجيل والدخول، والبحث عن الموارد، وتنزيل الموارد، والمشاركة والتفاعل، وحجز دورات التدريب وورش العمل والمؤتمرات.', 'هيئة التدريس'),
(17, 'كلمة العميد ', 'تحية طيبة وبعد،\r\n\r\nأود أن أوجه كلمة من عميد كلية إلى طلاب وأعضاء هيئة التدريس والعاملين في الكلية.\r\n\r\nأعزائي الطلاب، نحن في الكلية نفتخر بكم وبجهودكم الجادة في دراستكم والتزامكم بتحقيق النجاح الأكاديمي. فأنتم الأمل والمستقبل الزاهر لهذه الكلية، ونحن نسعى جاهدين لتقديم ما هو أفضل لكم من خلال توفير بيئة تعليمية محفزة ومهنية وبرامج ومناهج دراسية حديثة ومميزة.\r\n\r\nونحن في الكلية نعمل بجد لتحقيق رؤيتنا بأن نكون مركزًا أكاديميًا متميزًا ومبتكرًا يقدم تعليمًا متميزًا ويساهم في تطوير وتقدم المجتمع. ونحن نعتزم تحقيق هذه الرؤية من خلال توفير بيئة تعليمية محفزة وتمكين الطلاب والموظفين وأعضاء هيئة التدريس بالموارد اللازمة لتحقيق أهدافهم الأكاديمية والمهنية.\r\n\r\nوأود أن أشكر أعضاء هيئة التدريس والعاملين في الكلية على جهودهم المتواصلة في تحقيق هذه الرؤية وتقديم الدعم والإرشاد للطلاب. فأنتم الركيزة الأساسية لنجاحنا في تحقيق أهدافنا ورفع مستوى التعليم والبحث والتطوير في الكلية.\r\n\r\nوأخيرًا، أود أن أشجع الجميع على الاستمرار في بذل الجهود الجادة في دراستهم وتحقيق النجاح الأكاديمي، وأن يستفيدوا من كل ما تقدمه الكلية من برامج وفرص لتطوير أنفسهم وتحقيق أحلامهم. ونحن في الكلية نعدكم بالتزامنا الدائم بتوفير كل ما يحتاجونه لتحقيق ذلك.\r\n\r\nشكرًا لكم جميعًا، وأتمنى للجميع التوفيق والنجاح الدائم', 'طالب'),
(18, 'السكن الجامعي', 'أهلاً بك، يوجد سكن جامعي في مدينة السادات، حيث توجد عدة جامعات ومؤسسات تعليمية في المدينة. ويتميز سكن الطلاب في مدينة السادات بأنه يضم مجموعة من المباني الحديثة والمجهزة بالكامل لتلبية احتياجات الطلاب، وتتضمن غرف نوم مفروشة بالكامل وغرف دراسة وصالات مشتركة ومطابخ مجهزة بالكامل ومساحات خضراء ومرافق للرياضة والترفيه.ويتميز سكن الطلاب في مدينة السادات بالأمان والراحة، إذ توفر المدينة بيئة هادئة وآمنة للطلاب، كما يوفر السكن الجامعي وسائل النقل المناسبة للوصول إلى المؤسسات التعليمية والمرافق العامة الأخرى في المدينة. ويتم إدارة سكن الطلاب بواسطة فريق من المشرفين والعاملين المدربين لتوفير بيئة مريحة وآمنة للطلاب.وتتوفر في مدينة السادات أيضًا خدمات إضافية للطلاب مثل الخدمات الطبية والتأمين الصحي والخدمات الغذائية والنشاطات الثقافية والاجتماعية والرياضية. ويمكن للطلاب الاستفادة من هذه الخدمات لتحسين تجربتهم الجامعية وتطويرهم الشخصي والأكاديمي.', 'طالب'),
(19, 'اقسام الكلية', ':١-علوم الحاسب\r\nيتميز قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي بأنه يشمل التخصصات الرئيسية في علوم الحاسب، بما في ذلك تطوير البرمجيات، وإدارة قواعد البيانات، والشبكات الحاسوبية، وأمن المعلومات، وتحليل البيانات، والذكاء الاصطناعي، والحوسبة السحابية، وتطوير تطبيقات الويب، والواقع الافتراضي والواقع المعزز.\r\n\r\nكما يتميز قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي بأنه يوفر للطلاب فرصًا للاستفادة من التكنولوجيا الحديثة والتعلم عن طريق العمل في مشاريع عملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم المعلومات، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\r\n\r\nبالإضافة إلى ذلك، يتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\r\n\r\nوتعمل كلية الحاسبات والذكاء الاصطناعي على فرضية أن الابتكار يأتي من خلال الاختلاف والانفتاح على الآراء المختلفة. لذلك، تشجع الكلية الطلاب على التفاعل مع بعضهم البعض ومشاركة أفكارهم وآرائهم، وتشجع أيضًا التعاون بين الطلاب والأساتذة على مستوى الكلية والجامعة.\r\n\r\nبشكل عام، يعدُّ قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في علوم الحاسب في العالم، ويتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات الحاسوب والتطبيقات المختلفة التي تستخدم في الصناعات المختلفة.\r\n\r\nوبذلك، يساهم قسم علوم الحاسب في كلية الحاسبات والذكاء الاصطناعي في تأهيل الطلاب وتزويدهم بالمهارات والمعارف اللازمة لمواكبة التطورات الحديثة في مجال الحوسبة وتحقيق النجاح في حياتهم المهنية.\r\n\r\n:٢-نظم ومعلومات\r\nيعدُّ قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي واحدًا من الأقسام الأكاديمية المهمة في الكلية، حيث يتم تدريس الطلاب كيفية تصميم وتطوير وإدارة نظم المعلومات المختلفة التي تستخدم في الصناعات المختلفة. ويهتم هذا القسم بدراسة البرمجيات والتطبيقات المختلفة التي تستخدم في جمع وتحليل البيانات، وكيفية تصميم النظم الحاسوبية التي تحل مشاكل العالم الحديث.\r\n\r\nيتميز قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي بأنه يغطي مجموعة واسعة من التخصصات والمجالات، حيث يشمل دراسة تصميم قواعد البيانات، وتحليل البيانات، وإدارة المشاريع، وتطوير تطبيقات الويب والمواقع الإلكترونية، والتحليل الاستراتيجي، والأمن السيبراني، والحوسبة السحابية، وتطوير البرمجيات.\r\n\r\nيتم تدريس الطلاب في قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي على أحدث التقنيات والأدوات المستخدمة في صناعة نظم المعلومات، مما يمكنهم من تطوير مهاراتهم في تحليل المشاكل وتصميم الحلول المناسبة، وتنفيذها وإدارتها بشكل فعال.\r\n\r\nيتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\r\n\r\nوتعمل كلية الحاسبات والذكاء الاصطناعي على تطوير مهارات الطلاب في قسم نظم المعلومات من خلال توفير فرص للتعلم من خلال العمل العملي والمشاريع العملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم المعلومات، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\r\n\r\nبشكل عام، يعدُّ قسم نظم المعلومات في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في مجال نظم المعلومات في العالم، حيث يتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات نظم المعلومات وتطبيقاتها المختلفة.\r\n\r\n:٣-الذكاء الاصطناعي\r\nيتميز قسم الذكاء الاصطناعي في كلية الحاسبات والذكاء الاصطناعي بأنه واحدًا من أهم الأقسام الأكاديمية في الكلية، حيث يركز على تعليم الطلاب كيفية تصميم وتطوير التطبيقات والنظم التي تعتمد على تقنيات الذكاء الاصطناعي.\r\n\r\nيشمل قسم الذكاء الاصطناعي في الكلية دراسة مجموعة واسعة من الموضوعات المتعلقة بالذكاء الاصطناعي، بما في ذلك تصميم وتطوير نماذج التعلم الآلي، وتصميم وتطوير نظم الروبوت، والتعلم العميق، ومعالجة اللغة الطبيعية، والتعلم الآلي في الرؤية الحاسوبية، وتحليل البيانات، والتعلم التعاوني، وأخرى.\r\n\r\nيتم تدريس الطلاب في قسم الذكاء الاصطناعي في الكلية على أحدث التقنيات والأدوات المستخدمة في مجال الذكاء الاصطناعي، مما يمكنهم من تطوير مهاراتهم في تحليل المشاكل وتصميم الحلول المناسبة، وتنفيذها وإدارتها بشكل فعال.\r\n\r\nيتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم الذكاء الاصطناعي في الكلية. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\r\n\r\nوتعمل كلية الحاسبات والذكاء الاصطناعي على تطوير مهارات الطلاب في قسم الذكاء الاصطناعي من خلال توفير فرص للتعلم من خلال العمل العملي والمشاريع العملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم الذكاء الاصطناعي، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\r\n\r\nبشكل عام، يعدُّ قسم الذكاء الاصطناعي في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في مجال الذكاء الاصطناعي في العالم، حيث يتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات الذكاء الاصطناعي وتطبيقاتها المختلفة.\r\n\r\n:٤-المعلوماتية الحيوية\r\nيعدُّ قسم المعلوماتية الحيواتية في كلية الحاسبات والذكاء الاصطناعي واحدًا من الأقسام الأكاديمية الهامة في الكلية، حيث يركز على تطوير التقنيات الحيوية والحوسبية المتعلقة بتحليل البيانات الحيوية وتخزينها وتحليلها وإدارتها.\r\n\r\nيشمل قسم المعلوماتية الحيواتية في الكلية دراسة مجموعة واسعة من الموضوعات المتعلقة بالحوسبة الحيوية، بما في ذلك تصميم وتطوير نظم الحوسبة الحيوية، وتحليل البيانات الحيوية، وتصميم وتطوير نظم المعلومات الحيوية، وتصميم وتطوير النماذج الحيوية، والتعلم الآلي في العلوم الحيوية، والجينوميات، وأخرى.\r\n\r\nيتم تدريس الطلاب في قسم المعلوماتية الحيواتية في الكلية على أحدث التقنيات والأدوات المستخدمة في مجال المعلوماتية الحيوية، مما يمكنهم من تطوير مهاراتهم في تحليل المشاكل وتصميم الحلول المناسبة، وتنفيذها وإدارتها بشكل فعال.\r\n\r\nيتم توفير بيئة تعليمية متعددة الثقافات واللغات في قسم المعلوماتية الحيواتية في الكلية. فالطلاب يأتون من خلفيات مختلفة ويتحدثون لغات متعددة، مما يساعد على توسيع آفاقهم وزيادة تفهمهم لثقافات مختلفة.\r\n\r\nوتعمل كلية الحاسبات والذكاء الاصطناعي على تطوير مهارات الطلاب في قسم المعلوماتية الحيواتية من خلال توفير فرص للتعلم من خلال العمل العملي والمشاريع العملية. فمن خلال المشاريع العملية المختلفة، يتم توفير فرص للطلاب لتطوير مهاراتهم في تصميم وتطوير البرمجيات ونظم المعلومات الحيوية، والتعلم من الأخطاء التي يقومون بها وتحسين أدائهم.\r\n\r\nبشكل عام، يعدُّ قسم المعلوماتية الحيواتية في كلية الحاسبات والذكاء الاصطناعي واحدًا من أفضل الأقسام الأكاديمية في مجال المعلوماتية الحيوية في العالم، حيث يتميز بتوفير بيئة تعليمية متميزة تجعلها وجهة رائدة للطلاب الراغبين في تعلم تقنيات المعلوماتية الحيوية وتطبيقاتها المختلفة.\r\n', 'طالب'),
(20, 'الخدمات الالكترونية', 'يتميز العصر الحالي بتقدم التكنولوجيا وتوسع استخدام الإنترنت في الحياة اليومية، ومن خلال هذا التطور تم تطوير عدة خدمات ومنصات تعليمية وعلمية لتسهيل الحصول على المعلومات وتوسيع دائرة المعرفة. وفي هذا المقال سنتحدث عن أربع خدمات علمية وتعليمية مميزة وهي: بنك المعرفة، نظام ابن الهيثم، هيئة ضمان جودة التعليم، والباحث العلمي.\r\n\r\n :١-بنك المعرفة\r\nبنك المعرفة هو خدمة مصرية تتيح للمستخدمين الحصول على المعلومات العلمية والتقنية الموثوقة من خلال قاعدة بيانات ضخمة تحتوي على أكثر من 50 ألف كتاب ومقالة ودراسة علمية وتقرير، بالإضافة إلى الصحف والمجلات والموسوعات والكتب المدرسية والمصادر الأخرى. ويعتبر بنك المعرفة مصدرًا هامًا للباحثين والطلاب والأكاديميين والمهتمين بالمعرفة والثقافة، حيث يوفر المحتوى الذي يشمل مجالات متعددة مثل العلوم والتكنولوجيا والفنون والآداب والإنسانيات والاقتصاد والعلوم الإدارية.\r\n\r\n :٢-نظام ابن الهيثم\r\nنظام ابن الهيثم هو منصة علمية تم تطويرها في السودان لتعزيز التعليم والبحث العلمي في مجالات العلوم الرياضية والفيزيائية والهندسية. ويتيح النظام للطلاب والباحثين الوصول إلى العديد من الموارد العلمية مثل المقالات العلمية والدوريات والكتب الإلكترونية والمحاضرات الأكاديمية. كما يوفر النظام مجموعة متنوعة من الأدوات والتقنيات الحديثة لتسهيل التعلم وتحسين النتائج الأكاديمية، ويعتبر نظام ابن الهيثم أحد الأدوات الحيوية التي تساعد في تطوير المناهج الدراسية وتعزيز المهارات العلمية للطلاب.\r\n\r\n:٣-هيئة ضمان جودة التعليم\r\nتهدف هيئة ضمان جودة التعليم في مصر إلى تعزيز مستوى التعليم في جميع المراحل التعليمية، من خلال تقييم ومراجعة المناهج الدراسية وتحديد المعايير العلمية للتعليم وتطويرها وتنفيذها، بالإضافة إلى تطوير آليات الإشراف على الجودة وتوفير المعلومات اللازمة للطلاب وأولياء الأمور والمجتمع بشكل عام. وتساهم هذه الخدمة في تحسين جودة التعليم ورفع المستوى العلمي للمجتمع بشكل عام.\r\n\r\n:٤-الباحث العلمي\r\nالباحث العلمي هي خدمة تقدمها شركة جوجل، وتهدف إلى تسهيل الوصول إلى الأبحاث والمقالات العلمية المختلفة في جميع المجالات الأكاديمية، وتوفير منصة للباحثين لنشر أبحاثهم والتواصل مع زملائهم في المجال العلمي. وتساعد هذه الخدمة الباحثين في توفير الوقت والجهد في العثور على المعلومات والأبحاث المتعلقة بمجالهم، كما تساعد على تطوير المجالات الأكاديمية والعلمية وتحسين النتائج البحثية.\r\n\r\nباختصار، تعتبر هذه الخدمات العلمية والتعليمية الأربعة منصات مهمة وحيوية لتسهيل الوصول إلى المعلومات العلمية وتحسين الجودة التعليمية وتطوير المجالات الأكاديمية المختلفة. فبنك المعرفة يوفر مجموعة كبيرة من المصادر العلمية والثقافية المتنوعة، ويساعد على تعزيز القدرات الأكاديمية للطلاب والباحثين. أما نظام ابن الهيثم فيعتبر أداة مهمة لتطوير المناهج الدراسية وتعزيز المهارات العلمية للطلاب. وتساعد هيئة ضمان جودة التعليم في مصر على تحسين جودة التعليم وتطويره، من خلال تقييم ومراجعة المناهج الدراسية وتطوير المعايير العلمية للتعليم. أما الباحث العلمي فهو أداة مهمة لتسهيل الوصول إلى الأبحاث والمقالات العلمية المختلفة في جميع المجالات الأكاديمية، وتساعد على تطوير المجالات الأكاديمية والعلمية وتحسين النتائج البحثية.\r\n\r\nتعتبر هذه الخدمات الأربعة منصات مهمة لتعزيز العلوم والثقافة، وتطوير المهارات الأكاديمية والعلمية، وتحسين جودة التعليم والبحث العلمي. ويمكن للمستخدمين الاستفادة منها بشكل كبير في تطوير معارفهم وقدراتهم الأكاديمية والعلمية، وتحسين أدائهم في مختلف المجالات الأكاديمية والعلمية. ومن المهم الاستفادة من هذه الخدمات والتعرف على فوائدها، حتى يتم تحسين الأداء الأكاديمي والعلمي وتطوير المجالات الأكاديمية والثقافية والعلمية في المجتمع.', 'طالب'),
(22, 'مركز التوظيف و التدريب', '\r\nيهدف مركز التوظيف والتدريب في كلية الحاسبات والذكاء الاصطناعي إلى تقديم الدعم والمساعدة للطلاب والخريجين في تحقيق أهدافهم المهنية والتوجيه الوظيفي، حيث يعمل المركز على توفير فرص التدريب والتوظيف والتطوير المهني للطلاب والخريجين.\r\n\r\n:ويقوم المركز بتوفير العديد من الخدمات والبرامج التدريبية والتوظيفية مثل\r\n\r\n١- توفير فرص التدريب العملي: حيث يتم توفير فرص التدريب في الشركات والمؤسسات المتعاونة مع الكلية، وذلك لتعزيز مهارات الطلاب وتحسين فرصهم في سوق العمل.\r\n٢- توفير فرص العمل: حيث يعمل المركز على توفير فرص العمل المناسبة للخريجين وتسهيل عملية الوصول إلى هذه الفرص.\r\n٣- تطوير مهارات البحث عن الوظيفة: حيث يقوم المركز بتطوير مهارات الطلاب في البحث عن الوظيفة وإعداد السيرة الذاتية والمقابلات الشخصية.\r\n٤- تنظيم فعاليات التوظيف: حيث يقوم المركز بتنظيم فعاليات التوظيف والمعارض الوظيفية لتوفير فرص التوظيف للطلاب والخريجين.\r\n٥- تطوير مهارات البحث عن الوظيفة: حيث يقوم المركز بتطوير مهارات الطلاب في البحث عن الوظيفة وإعداد السيرة الذاتية والمقابلات الشخصية.\r\nوبذلك، يسعى مركز التوظيف والتدريب في كلية الحاسبات والذكاء الاصطناعي إلى توفير الدعم اللازم للطلاب والخريجين لتحقيق أهدافهم المهنية وتطوير مهاراتهم اللازمة لمواكبة التطورات الحديثة في سوق العمل.\r\n\r\n', 'طالب'),
(23, 'الانشطة الطلابية', 'تتنوع النشاطات الطلابية في كلية الحاسبات والذكاء الاصطناعي وتشمل العديد من الفعاليات والأنشطة التي تهدف إلى تطوير وتعزيز المهارات الاجتماعية والأكاديمية للطلاب، وتشجيعهم على المشاركة الفعالة في الحياة الطلابية وتحقيق الإنجازات الشخصية والجماعية.\r\n\r\n: من أبرز الأنشطة الطلابية في كلية الحاسبات والذكاء الاصطناعي\r\n\r\n١- النادي الطلابي  :  ويهدف إلى تنظيم الفعاليات الطلابية المختلفة وتحسين العلاقات الاجتماعية بين الطلاب وتطوير مهارات القيادة والتنظيم والعمل الجماعي.\r\n\r\n٢- الأندية الفنية والثقافية: وتشمل الأنشطة الفنية والثقافية المختلفة مثل المسابقات الفنية والأدبية والمسرحيات والعروض الفنية والمعارض الثقافية.\r\n\r\n٣- الرياضة: وتشمل الأنشطة الرياضية المختلفة مثل كرة القدم والسلة والكرة الطائرة وغيرها، وتعزيز الروح الرياضية والصحة البدنية للطلاب.\r\n\r\n٤-النشاطات الأكاديمية: وتشمل تنظيم المسابقات الأكاديمية والندوات وورش العمل والمحاضرات العلمية والتقنية التي تساعد الطلاب على تطوير مهاراتهم الأكاديمية والتقنية.\r\n\r\n٥- العمل التطوعي: ويهدف إلى تعزيز الوعي المجتمعي والمساهمة في خدمة المجتمع من خلال مشاركة الطلاب في الأنشطة التطوعية المختلفة مثل التنظيف والزيارات للمرضى والمسنين وغيرها.\r\n\r\nوتسعى كلية الحاسبات والذكاء الاصطناعي إلى توفير بيئة تعليمية متميزة ومحفزة للطلاب وتشجيعهم على المشاركة الفعالة في الحياة الطلابية وتحقيق أهدافهم الشخصية والأكاديمية.', 'طالب'),
(24, 'رؤية الكلية', 'تهدف رؤية كلية الحاسبات والذكاء الاصطناعي إلى تحقيق الريادة في مجال الحوسبة والذكاء الاصطناعي وتعزيز قدرات الطلاب والخريجين لمواكبة التطورات الحديثة والمشاركة في حل المشاكل الهندسية والتقنية التي تواجه المجتمع.\r\n\r\nوتتجسد رؤية الكلية في توفير بيئة تعليمية محفزة ومتطورة للطلاب وتمكينهم بالمهارات والمعارف اللازمة لتطوير وتصميم وتطبيق الحلول الحاسوبية والذكاء الاصطناعي في مختلف المجالات.\r\n\r\nوتسعى الكلية إلى تحقيق رؤيتها من خلال تقديم برامج دراسية متميزة ومناهج حديثة ومتطورة وتوفير بيئة تعليمية متميزة ومهنية، كما تهدف إلى تعزيز البحث العلمي والتطوير التقني والإسهام في حل المشاكل الهندسية والتقنية التي تواجه المجتمع.\r\n\r\nوبذلك، تسعى الكلية إلى إعداد خريجين مؤهلين ومتميزين في مجال الحوسبة والذكاء الاصطناعي، والذين يمكنهم المنافسة في سوق العمل المحلي والعالمي والمساهمة في تحسين جودة الحياة للأفراد والمجتمعات.', 'طالب');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `contact`
--
ALTER TABLE `contact`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `departments`
--
ALTER TABLE `departments`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `event`
--
ALTER TABLE `event`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `faqs`
--
ALTER TABLE `faqs`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `login`
--
ALTER TABLE `login`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `news`
--
ALTER TABLE `news`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `services`
--
ALTER TABLE `services`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `contact`
--
ALTER TABLE `contact`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;

--
-- AUTO_INCREMENT for table `departments`
--
ALTER TABLE `departments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT for table `event`
--
ALTER TABLE `event`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `faqs`
--
ALTER TABLE `faqs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=42;

--
-- AUTO_INCREMENT for table `login`
--
ALTER TABLE `login`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `news`
--
ALTER TABLE `news`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=49;

--
-- AUTO_INCREMENT for table `services`
--
ALTER TABLE `services`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=25;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
